In [3]:
from dask.distributed import Client
# using Client function to connect Scheduler endpoint 
client = Client("tcp://172.31.36.115:8786")
print(client)

<Client: 'tcp://172.31.36.115:8786' processes=2 threads=4, memory=15.50 GiB>

In [5]:
import dask.dataframe as dd
# loading csv file 
ddf = dd.read_csv('s3://delvex-software-center/USGS/large_dataset.csv' , storage_options={"anon": True})

In [6]:
# printing head 
ddf.head()

   ID     Name  Age      City     Salary
0   1      Bob   33   Phoenix  104608.15
1   2  Charlie   25  New York   42922.03
2   3    Alice   55   Chicago   40155.43
3   4      Bob   18   Chicago   36625.62
4   5  Charlie   30   Houston  101225.42

In [8]:
# calculate average salary by City 
avg_salbycity = ddf.groupby('City')['Salary'].min()
# calling some action function 
avg_salary = avg_salbycity.compute()
print(avg_salary)

City
Chicago        30006.56
Houston        30000.02
Los Angeles    30003.62
New York       30003.23
Phoenix        30000.17
Name: Salary, dtype: float64

In [9]:
# calculate average salary by City 
max_salbycity = ddf.groupby('City')['Salary'].max()
# calling some action function 
max_salary = max_salbycity.compute()
print(max_salary)

City
Chicago        119999.89
Houston        119994.74
Los Angeles    119992.94
New York       119993.78
Phoenix        119999.72
Name: Salary, dtype: float64

In [10]:
# if want to print aggregations of salaries
agg_salbycity = ddf.groupby('City')['Salary'].agg(['min','max','mean'])
agg_salary = agg_salbycity.compute()
print(agg_salary)

                  min        max          mean
City
Phoenix      30000.17  119999.72  75158.256643
New York     30003.23  119993.78  75170.690729
Chicago      30006.56  119999.89  75034.949588
Houston      30000.02  119994.74  74985.787845
Los Angeles  30003.62  119992.94  75044.818046

In [12]:
# filtering rows having age more 35 years 
filter1 = ddf[ddf['Age'] > 35 ]
peopledata = filter1.compute()
print(peopledata)

          ID   Name  Age         City     Salary
2          3  Alice   55      Chicago   40155.43
7          8  David   56      Phoenix   87637.78
8          9  Alice   40      Phoenix   67813.78
9         10    Bob   47      Phoenix   38681.44
11        12  Alice   44  Los Angeles  109205.52
...      ...    ...  ...          ...        ...
99991  99992  David   64     New York  116105.58
99992  99993    Eva   37  Los Angeles   70851.86
99993  99994    Eva   52      Houston  104017.66
99995  99996  Alice   56     New York   32433.29
99997  99998    Eva   64      Houston   83727.26

[61700 rows x 5 columns]

In [ ]:
# save filterd data into csv file 
peopledata.to_csv('35yabovepeople.csv',index=True)